[[["629ca169-2a57-4097-a647-dcf617bfc82a",{"pageContent":"Dhana D \n  \nPROFESSIONAL SUMMARY \n \nWith over 7+ years of experience, worked as a full stack developer and gained expertise in various aspects of the software \ndevelopment life cycle including requirements  gathering, analysis, design, development, testing, and deployment of Java \nand J2EE object-oriented technologies for client/server-based applications. \n• Proficiency  in  utilizing Waterfall,  Agile,  and  Scrum  methodologies throughout  the Software  Development  Life \nCycle (SDLC), including requirement specification, documentation of software architecture and design specifications, \nJava implementation, mentoring, and delivering architecture presentations to a diverse set of stakeholders. \n• Working  knowledge  of front-end  technologies utilized  in  developing  user  interactive  (UI)  web  pages,  including \nHTML5, CSS, JSON, JSTL, Bootstrap, JavaScript, NodeJS, jQuery, GraphQL, and AJAX.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":1,"to":12}}}}],["14f8973b-4e7b-4a47-901b-6cfa1bd39360",{"pageContent":"HTML5, CSS, JSON, JSTL, Bootstrap, JavaScript, NodeJS, jQuery, GraphQL, and AJAX. \n• Experience in developing enterprise-level MERN Stack applications, by writing server-side code using Node.js and \nExpress framework, utilizing MongoDB database to store and retrieve data, and designing the front-end using React. \n• Experienced in ReactJS utilizing both React Flux and Redux architecture, implemented complex OOP concepts to \nenhance  website  performance  by using ReactJS  components,  Forms,  Events,  Keys,  Router,  Redux,  Animations, \nand Flux concept and have good understanding of state store, middleware, action creator, reducer, and container. \n• Hands-on experience in utilizing Angular to construct Single Page Applications, and possess a strong comprehension \nof creating custom directives, services, components, and routing in Angular. \n• Experienced working  with  Object-Oriented  Programming  (OOP) design  patterns,  including Singleton,  Abstract","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":12,"to":20}}}}],["5eb41a63-08be-406c-8799-710655996eeb",{"pageContent":"of creating custom directives, services, components, and routing in Angular. \n• Experienced working  with  Object-Oriented  Programming  (OOP) design  patterns,  including Singleton,  Abstract \nFactory, Factory Method, Prototype, Builder, and Dependency Injection, in Angular. \n• Skilled in utilizing various UI testing frameworks for web applications, like Karma, Jasmine, Enzyme, Protractor \n(for AngularJS), Mocha, Jest, Chai (for ReactJS and BackboneJS), and Spock (for testing backend services). \n• Good understanding of EMAC Script, mainly ES5 and ES 6, and JavaScript trans-compiler Typescript. Experienced \nin utilizing advanced JavaScript concepts like Closures, Promises, Prototype, map, reduce, filter, and async/await. \n• Skilled in implementing Java/J2EE design Patterns including command, object pool, singleton, session facade, \nData Transfer Object (DAO), Model View Controller (MVC), and Data Access Object (DAO).","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":19,"to":27}}}}],["fb2dbc52-4150-49e2-97f3-8cf2375a58bc",{"pageContent":"• Skilled in implementing Java/J2EE design Patterns including command, object pool, singleton, session facade, \nData Transfer Object (DAO), Model View Controller (MVC), and Data Access Object (DAO). \n• Experience in Java EE technologies, including Servlets, Java Server Pages (JSP), JSTL, Web Services (SOAP and \nREST), JDBC, Java Server Faces (JSF), Java Message Service (JMS), JNDI, and Java Mail. \n• Practical experience in Core Java and possesses a thorough comprehension and working knowledge of Object-Oriented \nProgramming as well as APIs such as Collections, Java beans, Multi-Threading, and Exception. \n• Good understanding of Core Java SE 8 concepts such as Exception Handling, Functional Interfaces, Streams API, \nTime API, Multithreading, Transaction Management, Lambda functions, Generics, and Collection API. \n• Strong understanding of prevalent API technologies like Spring Boot and Microservices and proficient in developing","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":26,"to":34}}}}],["04dac6b6-8187-4bb8-8f88-7e2edb8704fc",{"pageContent":"• Strong understanding of prevalent API technologies like Spring Boot and Microservices and proficient in developing \nback-end functionalities using microservices that are utilized by web applications designed with Angular. \n• Experience in utilizing AngularJS to consume RESTful web services that provide data in XML and JSON formats. \n• Extensive knowledge of Microservices architecture and has experience in implementing various design patterns and \ndesigned and developed RESTful Web services utilizing Spring Rest and JAX-RS. \n• Employed Microservice architecture approach in  combination with Spring  Boot based  services and  established \ncommunication between services achieved through a combination of REST and Apache Kafka message brokers. \n• Proficient working with RESTful Web Services and have expertise in implementing RESTful APIs. as well as have  \n• Participated in the development of SOAP web services utilizing WSDL, JAXB, CXF, AXIS, JAX-WS and developed","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":34,"to":42}}}}],["b0c4f142-7294-4ce1-b9df-6dc0a4682924",{"pageContent":"• Participated in the development of SOAP web services utilizing WSDL, JAXB, CXF, AXIS, JAX-WS and developed \nRestful web services using JAX-RS, CXF and JERSEY APIs as well as created using AXIS/Rest API. \n• Worked  on  multiple  modules  of  the Spring Framework,  such  as Spring  Web  Flow,  Spring  Core,  Spring  MVC, \nSpring ORM, Spring JDBC, Spring Security and Spring Cloud. Also proficient in implementing the Inversion of \nControl (IoC) and Dependency Injection (DI) concepts of the Spring Application Framework. \n• Employed Spring Boot Actuator to supervise and regulate the application in the production environment. \n• Good  Knowledge  on  working  with OAUTH2.0 to  provide  authentication  and  authorization  to Rest  services by \nexchanging Access tokens and used JSON Web Tokens (JWT) to securely communicate JSON Objects. \n• Expert in developing Enterprise Java Beans (EJB) and Message Driven Beans (MDB) components and proficient in","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":42,"to":50}}}}],["ead48945-5d90-4c67-bd44-7d23cf846fa1",{"pageContent":"• Expert in developing Enterprise Java Beans (EJB) and Message Driven Beans (MDB) components and proficient in \nutilizing MQ channels like IBM  MQ,  Rabbit  MQ,  Active  MQ and Kafka for  asynchronous communications  and \nimplemented Java Messaging Service (JMS) for dependable information exchange across Java applications.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":50,"to":52}}}}],["44a370d8-1fe2-41db-85e7-a50de4d4fb60",{"pageContent":"• Experience  in  working  with NoSQL-based ORM frameworks  such  as Mongoose  Connector and Cassandra  Node \nDriver and  have  a  strong  foundation  in RDBMS databases  such  as Oracle,  SQL  Server and MySQL, as  well  as \nNoSQL databases such as MongoDB and Redis and possess excellent skills in writing SQL queries. \n• Efficient in deploying applications using IBM WebSphere, WebLogic App Server, JBoss and Tomcat Webserver. \n• Proficient working  with  testing  tools  such  as Postman,  TestNG,  Jest, Enzyme  and  Apache  JMeter in  addition  to \nutilizing debugging tools like ESLint, Redux DevTools and Chrome Developer Tools. \n• Experienced in Test Driven Development using JUnit and Mockito, developed SOAP and RESTful Web Services \nwith SOAP UI and Postman and worked on Apache Camel, Docker, Swagger, Liquibase script, and Lombok. \n• Hands-on  experience  in  utilizing various build  tools  such  as Gruntjs,  Gulp  Server and Yeoman as  task  runners  to","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":1,"to":9}}}}],["64a89b9a-e7de-41ff-95d6-a90376d9a38f",{"pageContent":"• Hands-on  experience  in  utilizing various build  tools  such  as Gruntjs,  Gulp  Server and Yeoman as  task  runners  to \ncarry  out repetitive  tasks  such  as Minification,  compilation and Unit  testing. Experienced  in  integration  and \ndeployment of applications using ANT, Maven, Gradle, Jenkins & debugging through log4j and Splunk. \n• Automation Testing of web-based applications and services with proficiency in Java, REST API, Selenium WebDriver. \n• Highly  skilled  in  utilizing version  control  systems specifically GIT, Subversion  (SVN), GitLab,  GitHub and \nBitbucket which were employed for executing tasks such as branching, tagging, merging.  \n• Experience in using Git and SVN for version control, tracking bugs and issues with Jira, and implementing Continuous \nIntegration and Continuous Deployment (CI/CD) through tools such as Jenkins, Argo CD and GitHub Actions.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":9,"to":16}}}}],["a0ad4149-ab14-4170-a542-f78b3c13c641",{"pageContent":"Integration and Continuous Deployment (CI/CD) through tools such as Jenkins, Argo CD and GitHub Actions.  \n• Experienced in Docker, and  deployed microservices  on Docker Containers and utilized Docker and Kubernetes as \nruntime environments for development, testing, and deployment and implemented container-based deployments.  \n• Hands-on   experience   on   various AWS   Cloud   services like EC2,   Route53,   EBS,   Auto   Scaling,   VPC, \nCloudFormation,  S3,  RDS, Amazon  Elastic  Load  Balancing, IAM,  Cloud  Watch and  other  services  of  the AWS \ninfrastructure like Dynamo DB, SQS and EMR focusing on high-availability, fault tolerance and auto-scaling. \n• Experience  in Object  Oriented  Design and  Implementation,  as  well  as  working  with  the Microsoft  Azure  cloud \nproduct suite, including Service Bus, Event Hub, Azure Function, Azure Blob Storage and Azure Cosmos DB.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":16,"to":23}}}}],["c16e7882-8856-43a6-8f05-4f09b66def8a",{"pageContent":"product suite, including Service Bus, Event Hub, Azure Function, Azure Blob Storage and Azure Cosmos DB. \n• Hands-on experience and a deep understanding of the GCP environment with a particular focus on using Google Big \nQuery, Google Pub/sub, Google Spanner, Dataflow, Compute Engine, and Google Storage. \n• Experience  in  using JIRA, Version-One for  bug  tracking  in  project  level and integrated  several JIRA plugins like \nJIRA client, JIRA importer plugin, JIRA charting plugin, Microsoft Project connector, and JIRA custom field. \n \n \nTECHNICAL SKILLS \n \nJava Technologies Java 8/11, Spring MVC, Spring Framework, Spring boot, Hibernate, JDBC, Servlets, JSP, \nJSTL,  Struts,  Multithreading,  Angular,  Spring  Security,  Apache  CXF,  Swing,  AmberJS, \nGroovy Grails, React, REST APIs, SOAP APIs, Microservices \nWeb Technologies jQuery, HTML, HTML5, CSS, CSS3, AJAX, DOM, TypeScript, DHTML, XHTML, RWD, \nJSON, XML, SASS, SCSS","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":23,"to":36}}}}],["4b526fe9-5894-490a-8575-42f5236b3b2e",{"pageContent":"Groovy Grails, React, REST APIs, SOAP APIs, Microservices \nWeb Technologies jQuery, HTML, HTML5, CSS, CSS3, AJAX, DOM, TypeScript, DHTML, XHTML, RWD, \nJSON, XML, SASS, SCSS \nSoftware Methodologies Agile, Scrum Design Pattern Session, BDD, TDD, Waterfall \nLanguages C, C++, Java, JavaScript, HTML, Python \nJavaScript Technologies React, ReactJS AngularJS, Angular, JavaScript, TypeScript, jQuery, EXT.js, Backbone.js, \nRequire.js, Servlets, JSP, NodeJS, VueJS, Redux, JSON, JMS, React Native \nOperating Systems Windows, Linux, MacOS, UNIX \nMessaging Platforms Kafka, JMS, ActiveMQ, RabbitMQ, IBM WebSphere MQ \nCloud GCP, AWS, Azure \nDatabases Oracle,  MS  SQL  Server,  MySQL,  MongoDB,  Redis,  Cassandra,  CouchDB,  PL/  SQL, \nPostgreSQL, Dynamo DB, Boto3, NumPy, Pandas library \nTesting Frameworks JUnit, JMeter, Mockito, Selenium, TestNG, Karma, Jasmine, FitNesse, Fire Poster, SOAP \nUI, Protractor, FireBug \nBug Tracking and \nReporting \nJIRA, Bugzilla, Bug Herd, Mantis Bug Tracker","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":34,"to":50}}}}],["cb9ec936-6646-47a9-a7a4-62ff4d8b35c4",{"pageContent":"UI, Protractor, FireBug \nBug Tracking and \nReporting \nJIRA, Bugzilla, Bug Herd, Mantis Bug Tracker \nVersion and Source \nControl \nGIT, SVN, Bit-Bucket, CVS, Rational Clear Case \nProject & Build Tools Docker, Kubernetes, Jenkins, Maven, Gradle","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":47,"to":54}}}}],["23c68f5a-f661-4505-a870-66fa32a76d89",{"pageContent":"MARSH MCLENNAN, Baltimore, MD                                                                                          June 2022 - Present \n \nRole: Sr Full Stack Developer \nMarsh McLennan is a multinational company that provides professional services in insurance brokerage. As a part of Mercer \nteam my  work  involves  designing,  developing,  and  maintaining  complex  Java  applications,  collaborating  with  cross-\nfunctional teams, and ensuring high-quality code while working on both the front-end and back-end technologies.  \n• Worked in all stages  of the software development life cycle, including requirement gathering, design, development, \ntesting, deployment, and maintenance, using the Scrum methodology in an Agile environment. \n• Develop presentation  layer  with JSPs,  HTML5,  JavaScript,  CSS3,  Bootstrap,  jQuery,  JSON,  AJAX,  Angular, \nSpring Form tags, JSTL Tags and Coded standards complaint HTML5 and CSS3.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":1,"to":10}}}}],["f7f7b599-2865-41e6-8ea2-cd253b64cc4e",{"pageContent":"• Develop presentation  layer  with JSPs,  HTML5,  JavaScript,  CSS3,  Bootstrap,  jQuery,  JSON,  AJAX,  Angular, \nSpring Form tags, JSTL Tags and Coded standards complaint HTML5 and CSS3.  \n• Implemented Angular  directives, expressions,  routing  capabilities for bookmarking,  filters,  validations and \nAngular UI components, Components, ng-Modules, Providers, Services and classes for navigation. \n• Maintain  and  customize JavaScript (and ActionScript)  frameworks  to  tailor  applications  to  suit  client needs and \nworked on the JavaScript library that simplifies HTML document traversing, and event handling. \n• Applied  core Java technologies,  such  as  Object-Oriented  Programming (OOP) concepts, Collections, String \nhandling, Multithreading, and searching algorithms, to enhance system performance. \n• Involved  in  working  on  Object-Oriented  analysis  and  design,  with J2EE design  patterns  including Singleton,","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":9,"to":17}}}}],["17fcd9bd-a6fe-4f01-9a1e-6284dcb71999",{"pageContent":"• Involved  in  working  on  Object-Oriented  analysis  and  design,  with J2EE design  patterns  including Singleton, \nPrototype, Session Facade, Data Transfer Object (DTO) and Business Delegate. \n• Worked on end-to-end testing using Grunt automation and unit testing of JavaScript using Karma, Jasmine tools. \n• Used Java concepts  like Collections,  Exception  handling,  Concurrency to  develop  business  logic.  Worked  with \nJ2EE and J2SE technologies including JSP's, Servlets, Java Web Start, EJB’s and Web logic. \n• Extensively  used Java 8 features lambda  expressions,  Parallel  operations on collections,  multithreading and  for \neffective sorting mechanisms, worked on Java 8 with Cold Fusion. Used Streams and Lambda expressions available \nin Java 8 to store and process the data and used Collections Lists, Sets, and Maps and advance core Java principles. \n• Developed Microservice that  uses Spring  Boot to  provide Restful  API and  utilized  various  data  persistence","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":17,"to":25}}}}],["257b9a39-34e7-467e-bb65-671239252bc8",{"pageContent":"• Developed Microservice that  uses Spring  Boot to  provide Restful  API and  utilized  various  data  persistence \nframeworks such as Hibernate and JPA as well as messaging engines. Implemented Persistent Logic using Java JPA \nalong with Spring hibernate JPA and easily get access to data using features such as Stored Procedures. \n• Implemented SOA (Service Oriented Architecture) for developing Spring Restful/Microservices along with Spring \nEureka and Netflix as part of service discovery using Apache Axis and Spring Ribbon for load balancing. \n• Consumed  and  created SOA services  like Soap and Restful Web  Services  and  tested  using SOAP  UI and  used  the \nfeatures of Spring Core layer (IOC), Spring AOP and Spring JDBC in order to develop the application. \n• Designed  and  implemented  an  application  using Spring  Boot,  Spring  IOC, Spring  transactions, Dependency \nInjection, Spring Annotations, Spring AOP, Spring Actuator, Spring Container managed transactions.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":25,"to":33}}}}],["0387c87c-f7c7-42a8-b435-1a9380cf4bf9",{"pageContent":"Injection, Spring Annotations, Spring AOP, Spring Actuator, Spring Container managed transactions. \n• Implemented  the  associated  business  modules  integration  using spring and Hibernate data  mapping and utilized \nSpring Boot, Cloud, Spring Data using CURD repository, Spring Batch, Spring Kafka modules. \n• Implementing RESTful Webservices to retrieve  data from client side and  made RESTAPI  calls from Angular and \nparsed the data to project client and handled the security and authorization using OAuth and JWT. \n• Integrated Spring Security via JWT/OAuth with Auth0, Firebase, Google, Facebook, and Twitter for Social Sign-in. \n• Worked on  the  Security  frameworks  like OAuth  2.0,  JWT token-based authentication, Spring Security  and \nimplemented Single Sign-On (SSO) using Site Minder on single/multiple cookie domains for Web applications. \n• Used Apache  Kafka (Message  Queues)  for  reliable  and  asynchronous  exchange  of  important  information  between","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":33,"to":41}}}}],["3a3a9860-86ff-42b7-816b-930c6c22d9c1",{"pageContent":"• Used Apache  Kafka (Message  Queues)  for  reliable  and  asynchronous  exchange  of  important  information  between \nmultiple business applications and involved in developing an automation tool in Java and Scala. \n• Worked on Rest Services to expose these services as webservices with JAX-RS and Jackson Binder serialization for \nJSON format and used Postman to test Rest Service end point. \n• Utilized JUnit, Advanced Rest Client, and Log4j to implement Test Driven Development (TDD) for creating test \ncases and determining the functionality of the application. \n• User-generated  data  is  stored  using  the NOSQL database  management  system Mongo  DB and  knowledge  of  using \nrelational databases. Designed and developed several PL/SQL blocks and stored procedures in the DB2 database. \n• Conduct performance testing of Apache and Tomcat management services. Program and prepare code for interfacing","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":41,"to":49}}}}],["b41fee01-26cc-402a-813c-bec18d6993d9",{"pageContent":"• Conduct performance testing of Apache and Tomcat management services. Program and prepare code for interfacing \nwith Apache Tomcat Systems. Performance tuning and deploying of Apache Tomcat applications. \n• Used Gradle for configuring automation of building process for Java application and configured Gradle plugins to \nsupport tasks such as compiling code, running tests and packaging artifacts. \n• Utilized Git for version control and maintaining both  recent and previous  versions  of files, including web pages  and \nsource code and used GitHub for source configuration management (version control).","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":49,"to":54}}}}],["f1064a2e-745e-45f0-969c-8936636318be",{"pageContent":"• Work with the processes and tools related to DevOps and Agile operations such as Code review, unit test automation, \nBuild & Release automation, Environment, Service, Incident and Change Management. \n• Used Jenkins and pipelines to  drive  all microservices builds  out  to  the Docker registry  and  then  deployed  to \nKubernetes, created Pods and managed  using Kubernetes. Configured  and  managed Kubernetes networking  and \nservice discovery using tools as Istio, Linkerd, or Flannel resulting in improved network performance and security. \n• Developed Docker files and Docker Compose files to manage the build and deployment of containerized applications \nacross multiple environments, such as Development, Testing and Production. \n• Created and  managed Jenkins jobs  to  automate  build,  test,  and  deployment  processes  for  various  projects and \nintegrating Jenkins with DevOps tools like Git, Docker and Kubernetes to facilitate seamless software delivery.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":1,"to":9}}}}],["c413e84c-60be-4dd7-8c3c-5929a396e18d",{"pageContent":"integrating Jenkins with DevOps tools like Git, Docker and Kubernetes to facilitate seamless software delivery. \n• Implemented the Hibernate framework (object relational mapping) to interact with the database. \n• Developed AWS cloud formation  templates  and  setting  up  Auto  scaling  for EC2 instances  and  involved  in  the \nautomated  provisioning  of AWS cloud environment  using Jenkins and Chef and  managed  servers  on  the Amazon \nWeb Services (AWS) platform instances using Chef configuration management. \n• Aware of troubleshooting issues on AWS, Netflix Eureka and other developer IDE and Cloud environments. \n• Involved in deployment of systems using EC2, S3, RDS, SQS, and Cloud Formation services from AWS Infrastructure. \n• Worked  on  services  provided  by  the Google  Cloud  Platform (GCP)  including  the compute  engine,  cloud  load \nbalancing, cloud storage, cloud SQL, stack driver monitoring, and cloud deployment manager.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":9,"to":17}}}}],["66c23e6b-5502-47da-8133-82b73f1f6fb2",{"pageContent":"balancing, cloud storage, cloud SQL, stack driver monitoring, and cloud deployment manager. \n• Used Jira to  generate  dynamic  dashboards  and  reports  that  provide  real-time  insights  on project  status,  team \nperformance, and key metrics such as velocity, burndown, and cycle time. \nEnvironment: HTML5, CSS3, Bootstrap, JavaScript, Angular, Spring MVC, Spring Boot, Typescript, Bootstrap, \nMicroservices, Jasmine, Karma, Mocha, JSON, JWT, OAUTH, Apache Kafka, RabbitMQ, PostgreSQL, Selenium, \nPostman, Junit, Mockito, Power Mock, Maven, Gradle, Log4J, GIT, Apache Tomcat, Jenkins, AWS, AJAX, JSP. \n \n \nKENDRA SCOTT, Austin, TX.                                                                                                    Jan 2022 – June 2022 \n \nRole: Full Stack Java Developer \nKendra Scott is a well-known brand in the fashion accessories industry that specializes in designing and producing jewelry","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":17,"to":28}}}}],["682a7b68-6c62-43b9-877c-771f6e492c12",{"pageContent":"Role: Full Stack Java Developer \nKendra Scott is a well-known brand in the fashion accessories industry that specializes in designing and producing jewelry \nfor women.  As  a Full Stack Java Developer, my responsibilities  included updating and  maintaining  web services  for the \napplications and supporting new data-driven capabilities to enhance our iconic customer experience. \n• Provided strategic direction on handling of all phases of the Software Development Life Cycle including requirement \ngathering,  designing,  and  estimating  project  timelines,  used agile  methodologies  such  as SCRUM to  develop  the \napplication, following the Agile process to complete the user stories scheduled for the sprint release. \n• Developed web-based GUI’s using various technologies such as JSP, HTML, DHTML, CSS, JavaScript (including \nJSON framework), Action Script, DOJO, Node JS, ReactJS, jQuery, EXT JS, and Ajax.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":27,"to":35}}}}],["0b2d5c60-c4eb-4cd8-a569-780dbd1c312b",{"pageContent":"• Developed web-based GUI’s using various technologies such as JSP, HTML, DHTML, CSS, JavaScript (including \nJSON framework), Action Script, DOJO, Node JS, ReactJS, jQuery, EXT JS, and Ajax. \n• Worked  on  responsive  design  and  developed  a  single ISOMORPHIC responsive  website that could  be  served  to \ndesktop, Tablets and mobile users using React JS. \n• Developed User Interface (UI) with Redux, forms  and  material UI for more interactive web pages  and developed \nthe Front-End and UI of ARWorks applications using JavaScript, ES6, React and Redux.  \n• Worked  with JavaScript events, functions and JavaScript  objects,  prototypes,  closures,  callback  functions and \npromise, also with Object-Oriented JavaScript such as Backbone.js, Knockout.js, Ember.js, Handlebars.js. \n• Developed Servlets and Java Server Pages (JSP) to route the submittals to the EJB components and render-retrieved \ninformation using Session Facade, Service Locator, DOA, DTO (J2EE Design patterns).","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":34,"to":43}}}}],["0f595f75-a0f6-4ec6-8aef-fd5590a44db1",{"pageContent":"information using Session Facade, Service Locator, DOA, DTO (J2EE Design patterns). \n• Analyzed and designed a scalable system based on OOP, OOAD and various J2EE design patterns and used software \nengineering design patterns and REST to achieve an efficient communication between applications. \n• Worked  with  unit  testing  of JavaScript front-end  logic using Karma,  Jasmine,  API  mocker,  Jest, enzyme and \ndebugging applications in different browsers using Firebug, and testing applications using QUnit. \n• Develop the primary components for the backend using Java 8 restful web services, using Elassandra, a combination \nof Elasticsearch and Cassandra for persistence and transforming XML and JSON inputs. \n• Used Java8's Stream API for executing bulk data operations on Collections. Designed applications using both Java7 \nand Java8, utilizing features such as lambdas, streams, multi-threading and the Executor Service framework.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":43,"to":51}}}}],["63177165-69da-4ed4-80e3-68201a7afabf",{"pageContent":"and Java8, utilizing features such as lambdas, streams, multi-threading and the Executor Service framework. \n• Implemented and utilized modern microservices frameworks and tools such as Spring Boot, Node.js and Micronaut \nto build and deploy microservices, resulting in improved development productivity and faster time-to-market.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":51,"to":53}}}}],["92fc0a06-2879-47c3-9028-2ba858389308",{"pageContent":"• Involved  in processing  of JSON data  retrieved  from  a RESTful web  service,  utilizing Axios to  access  database \nresources and populate the User Interface (UI). Middleware was facilitated by Redux-Saga. \n• Used Axios to fetch the data by consuming the Rest API and build REST web service by building Node.js Server in \nthe back end to handle requests sent from the front-end jQuery Ajax calls. \n• The Redux-Thunk middleware  was  used  with  the Redux store  to  retrieve  contract  data  via  a RESTful  API \nimplemented on the backend in Node.js and MongoDB and consuming the SOAP web services exposed by pay metric \n(third  party  vendor)  for  credit  card  transactions  using JAX-WS and worked  with NPM commands  and  using \npackage.json for managing dependencies and dev-dependencies of Node.js applications. \n• Used Spring Core Annotations for Dependency Injection Spring DI and Spring MVC for REST API’s and Spring","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":1,"to":9}}}}],["40e95627-0925-46e8-8c16-b7a832ed8245",{"pageContent":"package.json for managing dependencies and dev-dependencies of Node.js applications. \n• Used Spring Core Annotations for Dependency Injection Spring DI and Spring MVC for REST API’s and Spring \nBoot for micro-services and utilized Spring Data JPA to be utilized newer ways to query the databases. \n• Developed application  using  the Spring framework, utilizing its features such  as Spring  Dependency  Injection, \nSpring Web Flow with Spring MVC and Spring Boot, all within the IntelliJ IDEA development environment. \n• Used Object/Relational mapping software Persistence of objects in database tables with Hibernate. \n• Created business  reports  through  the  development  of Node-based services,  utilizing Express  JS as  middleware. \nSecured APIs by  employing OAuth  2.0 with JWT token  mechanism,  while  authentication/authorization  for  the \napplication was developed using multiple NPM node modules including regex and JWT Web Token.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":8,"to":16}}}}],["5f294587-d299-491c-a6c1-6a326733d38f",{"pageContent":"application was developed using multiple NPM node modules including regex and JWT Web Token. \n• Used ActiveMQ messaging to set up communication between applications in ESB and flows are created for JAX-WS \nand JAX-RS web services. Developed Restful Microservices deployed on AWS servers using EBS and EC2.  \n• Created robust RESTful web service using Apache CXF and automated documentation for the web services within the \napplication is provided by Swagger by configuring hapi-swaggered and hapi-swaggered-ui. \n• Conducted unit  testing,  integration  testing and system  testing of backend  APIs utilizing Java based  testing \nframeworks such as JUnit, TestNG to ensure quality and correctness of the code. \n• Developed  and  maintained Maven-based  projects  to  manage dependencies,  build  artifacts, and generate  reports. \nConfigured Maven plugins to automate tasks such as compiling code, running tests.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":16,"to":24}}}}],["3ce12537-f564-4fb7-b7d1-1a1b2811de71",{"pageContent":"Configured Maven plugins to automate tasks such as compiling code, running tests. \n• Worked  on Git  Bitbucket,  GIT responsibilities  include  maintaining  the  version  control  system  (branching  model, \nsecurity), creation and maintenance of build definitions\\scripts, and the setup of work item areas and iterations. \n• Involved in the  creation,  improvement,  and  automation  of  the  build  and  deployment  process for  every  release and \nbackup, restore and upgrade. Expertise in using Chef for cloud automation and working with DevOps platforms. \n• Automated the deployment of Docker containers using Continuous Integration and Continuous Delivery (CI/CD) \npipelines, such as Jenkins which helped in faster release cycles and improved quality assurance. \n• Developed  and  updated Kubernetes manifests  and Helm charts  to  specify  and  implement Kubernetes components \nsuch as Services, Pods, Deployments, and ConfigMaps and responsible for maintaining the resources.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":24,"to":32}}}}],["da00fe95-bea3-4dde-b254-f1b63d45eea8",{"pageContent":"such as Services, Pods, Deployments, and ConfigMaps and responsible for maintaining the resources. \n• Created SQL queries and stored procedures that use joins to retrieve data from various tables in remote databases. \n• Optimized database performance by analyzing query execution plans and implementing appropriate indexing strategies \nand designed and implemented NoSQL databases using MongoDB and Cassandra. \n• Created queries  and  performing CRUD  operations in NoSQL  databases and gained experience in  tasks such  as \ndatabase migration, data conversion and data synchronization between SQL and NoSQL databases. \n• Worked with Web/Application servers such as Apache Tomcat, Jboss, Oracle WebLogic Servers and WebSphere \nAS. Created war files and deployed them on Tomcat using the ANT deployment tool. \n• Worked with services offered by the Google Cloud Platform (GCP) including compute engine, cloud load balancing,","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":32,"to":40}}}}],["23a0ee21-ec57-4edc-be7f-65d44d2957e1",{"pageContent":"AS. Created war files and deployed them on Tomcat using the ANT deployment tool. \n• Worked with services offered by the Google Cloud Platform (GCP) including compute engine, cloud load balancing, \ncloud storage, cloud SQL, stack driver monitoring and cloud deployment manager. \n• Developed  the  framework  to  use  the  web  services  hosted  in  Compute  Engine  instances  of GCP  (Google  Cloud \nPlatform) and experience in setting up instances and working with BigQuery on the Google Cloud Platform. \n• Worked  on Microsoft  Azure  Cloud services  such  as Azure  Storage/Cosmos  DB/Azure  Service-Bus and  familiar \nwith Azure services including Compute, Azure Websites, Caching, SQL Azure NoSQL, Network services, Azure \nActive Directory, API Management, Auto Scaling, Scheduling, Storage and PowerShell Automation.  \n• Developed custom Jira plugins and integrations using Jira APIs and scripting, resulting in significant time savings \nand improved data accuracy.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":39,"to":48}}}}],["9dd49c26-0be0-4684-8f88-d48bd5ccab9b",{"pageContent":"• Developed custom Jira plugins and integrations using Jira APIs and scripting, resulting in significant time savings \nand improved data accuracy. \nEnvironment:  Java  8,  HTML5,  CSS3,  JavaScript,  React,  NodeJS,  Redux,  NPM,  Jasmine,  Karma,  Microservice, \nSpring  Boot,  MongoDB,  PostgreSQL,  Angular,  JSON, SOAP,  Hibernate  ORM,  Jenkins,  OAUTH,  JWT,  Kafka, \nRedis, Swagger, Junit, Mockito, Maven, JBOSS, GIT, SVN, GitHub, Docker, AWS.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":47,"to":51}}}}],["f8939814-a6eb-4f89-96a4-e9ad429d9c17",{"pageContent":"ELEVANCE HEALTH, Hyderabad.                                                                                             Jan 2020 – Aug 2021 \n \nRole:  Java Developer \nElevance Health, Inc. is an American health insurance provider. As a Java Developer, my responsibilities included updating \nand maintaining web services for the application that provides health benefits to the customers and enhancing capabilities \nfor the application to have wonderful customer experience. \n• Created various UI components for different web pages using HTML5, CSS3, JavaScript, jQuery, Vaadin framework \nReactJS. Designed Frontend within object-oriented Java Framework Vaadin. \n• Performed client-side validations using JavaScript and jQuery Framework. \n• Interacted with java controllers JQUERY, Ajax, and JSON to write/read data from back-end systems. \n• Used all aspects of MySQL/PHP Programming (Object Oriented PHP).","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":1,"to":11}}}}],["0d72830a-0e50-4d12-9dd0-0250493fe930",{"pageContent":"• Interacted with java controllers JQUERY, Ajax, and JSON to write/read data from back-end systems. \n• Used all aspects of MySQL/PHP Programming (Object Oriented PHP). \n• Worked on the Spring MVC architecture, which uses the Model-View-Controller design pattern to implement all the \nspring framework's capabilities, such as inversion of control, dependency injection, and aspect-oriented programming. \n• Worked at Integration layer (VIP), worked on Restful services  and used Spring IoC, DI and AOP managing beans \nand cross cutting concerns. \n• Designed, documented (Swagger) and developed Microservices (Admin Service, Reports Service, Audit Service, Loan \nProcessing Service) using Java, Spring Boot, Spring, Hibernate, JSON, JWT and MongoDB. \n• Mocha and Chai for testing Node and Enzyme for React application and used JUnit to test the Spring boot application. \n• Involved in developing code to convert a SOAP response into a JSON object and construct a tree in UI.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":10,"to":19}}}}],["5a2f222f-9fda-44b3-b385-2950912fe129",{"pageContent":"• Involved in developing code to convert a SOAP response into a JSON object and construct a tree in UI.  \n• Used Spring Security to control the  Authentication and  Authorization to access the resources  within the application. \nImplement OAuth2.0 and JWT Tokens. \n• Created Unit tests using Mocha, Sinon, Chai and Enzyme. \n• Developed  Restful  services  using  Spring  Framework  and  handled  access-control  features  like  authentication  and \nauthorization by using Spring Security, OAuth 2.0 with JWT. \n• REST API services were tested using the POSTMAN and SOAPUI tools and the Rest client. \n• Written SQL queries, stored procedures modifications, Local Data Base Changes and used Toad for testing environment \nfor existing database structure as required per addition of new features. \nEnvironment: Java5, JDBC, Servlets, JSP, MySQL, HTML, SOAP, Eclipse, WSDL, WebLogic Server, EJB, GIT, \nCSS, Strut.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":19,"to":29}}}}],["107523c8-f089-4bec-933b-f0e9f3c96a7f",{"pageContent":"for existing database structure as required per addition of new features. \nEnvironment: Java5, JDBC, Servlets, JSP, MySQL, HTML, SOAP, Eclipse, WSDL, WebLogic Server, EJB, GIT, \nCSS, Strut. \nEASYJET, Hyderabad.                                                                                                                   July 2015 – Dec 2019 \n \nRole: Full Stack Developer  \nEasyJet is a British multinational low-cost airline group headquartered at London Luton Airport. As a Full Stack Developer, \nmy work included developing web services for the application where customers can access it for the respective services. \n• Designed the algorithm and codes using design patterns and Object-Oriented Design methodology. \n• Expertise  in  using HTML,  CSS,  XML,  XSL,  XSLT,  JAXP,  JAXB,  JAVASCRIPT,  JQUERY,  JSON,  JSTL, \nBackbone JS, PHP, Express JS, Ext JS, React JS, Node JS and AJAX.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":27,"to":37}}}}],["014c69b8-374f-43ef-94b5-9fc647d92c45",{"pageContent":"• Expertise  in  using HTML,  CSS,  XML,  XSL,  XSLT,  JAXP,  JAXB,  JAVASCRIPT,  JQUERY,  JSON,  JSTL, \nBackbone JS, PHP, Express JS, Ext JS, React JS, Node JS and AJAX. \n• Focused  more  on Object-oriented  programming  (OOP) concepts and  implemented  the REST APIs and  data \ntransformers using the JAVA connector which involves the use of JAVA8 features Lambda and Streams. \n• Managed  Asynchronous  events RESTFUL  API Services  in TypeScript/JavaScript for  the  Angular  frontend  using \nDesign  Concepts  like Promises,  Observables,  Higher  Order  Functions,  Arrow  functions,  Async  Await,  and \nCallback Functions. \n• Involved  in  creation  and  configuration  of REST  client and REST  services for EAGLE biometric  services \ncommunicating with external applications. \n• Designed and developed the JSON restful web service to save the data in database. \n• Implemented SOAP, WSDL and a subset of XML Schema for a Web services toolkit and web services integration.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":36,"to":46}}}}],["176191cb-9856-490b-bc9a-1bde44322ac8",{"pageContent":"• Designed and developed the JSON restful web service to save the data in database. \n• Implemented SOAP, WSDL and a subset of XML Schema for a Web services toolkit and web services integration. \n• Involved in the application development using Spring Core, Spring Roo, Spring JEE, Spring Aspects modules and \nJava web-based   technologies   such   as   Web   Service   (REST   /SOA   /microservices) including   microservices \nimplementations and Hibernate ORM. \nEnvironment: HTML, CSS, React, JavaScript, PHP, SOAP, Unit Test, SOAP, Dreamweaver.","metadata":{"source":"/tmp/resume-processor-DDYoVi/Dhana_512-766-6499.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Author":"dhana.dharur21@gmail.com","Creator":"Microsoft® Word 2016","Producer":"www.ilovepdf.com","CreationDate":"D:20230327151451+00'00'","ModDate":"D:20230327151451Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":45,"to":50}}}}]],{"0":"629ca169-2a57-4097-a647-dcf617bfc82a","1":"14f8973b-4e7b-4a47-901b-6cfa1bd39360","2":"5eb41a63-08be-406c-8799-710655996eeb","3":"fb2dbc52-4150-49e2-97f3-8cf2375a58bc","4":"04dac6b6-8187-4bb8-8f88-7e2edb8704fc","5":"b0c4f142-7294-4ce1-b9df-6dc0a4682924","6":"ead48945-5d90-4c67-bd44-7d23cf846fa1","7":"44a370d8-1fe2-41db-85e7-a50de4d4fb60","8":"64a89b9a-e7de-41ff-95d6-a90376d9a38f","9":"a0ad4149-ab14-4170-a542-f78b3c13c641","10":"c16e7882-8856-43a6-8f05-4f09b66def8a","11":"4b526fe9-5894-490a-8575-42f5236b3b2e","12":"cb9ec936-6646-47a9-a7a4-62ff4d8b35c4","13":"23c68f5a-f661-4505-a870-66fa32a76d89","14":"f7f7b599-2865-41e6-8ea2-cd253b64cc4e","15":"17fcd9bd-a6fe-4f01-9a1e-6284dcb71999","16":"257b9a39-34e7-467e-bb65-671239252bc8","17":"0387c87c-f7c7-42a8-b435-1a9380cf4bf9","18":"3a3a9860-86ff-42b7-816b-930c6c22d9c1","19":"b41fee01-26cc-402a-813c-bec18d6993d9","20":"f1064a2e-745e-45f0-969c-8936636318be","21":"c413e84c-60be-4dd7-8c3c-5929a396e18d","22":"66c23e6b-5502-47da-8133-82b73f1f6fb2","23":"682a7b68-6c62-43b9-877c-771f6e492c12","24":"0b2d5c60-c4eb-4cd8-a569-780dbd1c312b","25":"0f595f75-a0f6-4ec6-8aef-fd5590a44db1","26":"63177165-69da-4ed4-80e3-68201a7afabf","27":"92fc0a06-2879-47c3-9028-2ba858389308","28":"40e95627-0925-46e8-8c16-b7a832ed8245","29":"5f294587-d299-491c-a6c1-6a326733d38f","30":"3ce12537-f564-4fb7-b7d1-1a1b2811de71","31":"da00fe95-bea3-4dde-b254-f1b63d45eea8","32":"23a0ee21-ec57-4edc-be7f-65d44d2957e1","33":"9dd49c26-0be0-4684-8f88-d48bd5ccab9b","34":"f8939814-a6eb-4f89-96a4-e9ad429d9c17","35":"0d72830a-0e50-4d12-9dd0-0250493fe930","36":"5a2f222f-9fda-44b3-b385-2950912fe129","37":"107523c8-f089-4bec-933b-f0e9f3c96a7f","38":"014c69b8-374f-43ef-94b5-9fc647d92c45","39":"176191cb-9856-490b-bc9a-1bde44322ac8"}]