[[["6ebbc524-d174-4e6a-ab51-175539285e43",{"pageContent":"Sai Bindu Reddy P || QA Engineer \nsaibindu0113@gmail.com || 9849009870 \n \nSUMMARY \n 5 Years of experience in Information Technology in Manual Testing Technology. \n Well Versed with Testing Concepts and Methodologies. \n Excellent understanding of the Software Development Life Cycle (SDLC) and Software Testing like Cycle (STLC) \nprocess. \n Expertise in Scrum Master methodology, responsible for the effective functioning of a software development team \nusing Agile Methodology. Maintain the backlog and release plans, publish reports to ensure the product owner is \nupdated about the team's progress. \n Highly motivated in Manual and Section 508 Compliance Testing JAWS Certified), currently looking for a \nposition as Accessibility Tester, ADA tester, Section 508 compliance tester, a Senior Accessibility tester/ \nAccessibility lead. \n Having experience as Accessibility Tester. I have tested all documents and applications for Section 508 \ncompliance.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":1,"to":16}}}}],["867c11a4-9809-4ea9-a415-17c2854382a4",{"pageContent":"Accessibility lead. \n Having experience as Accessibility Tester. I have tested all documents and applications for Section 508 \ncompliance. \n Participated in regression testing as needed. \n Developed primary training for testing team in Section 508 requirements and guidance. \n Created test cases to familiarize them with processes and procedures in accessibility testing. \n Worked with Section 508 team to develop processes for testing both web accessible training and documentation. \n Very good knowledge of testing methodologies, automation tools and best practices. \n Created new test cases and reporting template for use by the company in testing websites and systems. Tested \nand remediated documents for 508 compliances in Word, Excel, PDF, PowerPoint, and HTML formats. \n Experience of using SharePoint and Adobe tools. \n Tested documents and Web sites using accessibility tools such as JAWS, Magic, and ACC Verify. Provided","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":14,"to":25}}}}],["b4a43e6e-53cd-495d-ab31-a4a06c000903",{"pageContent":" Experience of using SharePoint and Adobe tools. \n Tested documents and Web sites using accessibility tools such as JAWS, Magic, and ACC Verify. Provided \nconsultation to Subject Matter Experts, Content Authors, and Technical Writers regarding proper formatting and \nrequirements. \n Trained staff on the importance and necessity of compliance and accessibility regarding the federal mandate. \n Developed training plans and requirements for accessibility courses. Assisted with web testing and reporting. \n Experience working with Accessibility Tools for major browsers - Firefox, IE, Chrome and Safari \n Expert level using shortcuts and keystrokes \n Experience/Expertise with JAWS, VOX, NVDA, \n Voiceover, Talkback, Narrator, Zoom text, WAT. \n Knowledge of Dragon Naturally Speaking, Magic software. \n Knowledge of web accessibility test scenarios and test conditions \n Experience of web-based accessibility tools Wave, Axe. \n Ability to discern accessibility issues from wireframes.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":24,"to":37}}}}],["239fea55-5eca-487f-8ccf-92eb34f06bec",{"pageContent":" Knowledge of web accessibility test scenarios and test conditions \n Experience of web-based accessibility tools Wave, Axe. \n Ability to discern accessibility issues from wireframes. \n Ability to quickly master new platforms, tools, and concepts. Experience in application testing in the Healthcare \nindustry. \n Experience in understanding the system technically, Providing expert level, professional capability, and support in \nquality management to the business on complex and critical quality projects.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":1,"lines":{"from":35,"to":41}}}}],["734d86a6-68df-42d4-8592-f13a2fe6332e",{"pageContent":" Prepare quality reports (around quality performance, KPIs, risks, and quality compliance). Defining and tracking \nmetrics necessary to measure and drive improvement in all areas of quality. Responsible for assuring a level of \nquality for the end client and help the software development team identify problems early in the process. \n Part of Quality Assurance Team on a path of constant improvement in all quality assurance disciplines including \ntesting, test automation, API Testing processes. \n Evaluate customer complaints about quality and escalate issues if required and provide training to project teams \nand perform required audits and perform root cause analysis and recommend preventive and corrective actions. \n Producing documentation, communications, and planning artifacts. Responsible for coordinating with other \nmanagers to schedule teamwork and manage testing resources across projects. Work with management on","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":1,"to":9}}}}],["48422256-f6b2-4652-add0-698a14daf45f",{"pageContent":"managers to schedule teamwork and manage testing resources across projects. Work with management on \ndefining and implementing testing and validation team roadmap, goals, and vision To triage defects by assigning \nappropriate priority, determining ownership of the detect, and routing the defect to the appropriate resource. \nInitiate and manage the escalation process for any defects exceeding SLAs. \n Collaborate with QA/Testing and Release/Change Management teams to maintain awareness of new code \nchanges, new test cycles, ongoing automation test results and new defects, bug fix scheduling and retesting. \nResponsible for evaluating and implementing new technologies into the current testing process. \n Responsible for ensuring that the testing strategy includes complete coverage of requirements and business \nprocess by working with other stakeholders of the project. \n Reviews testing results and ensures quality and adherence to SDLC processes. Experience of working in high","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":9,"to":18}}}}],["3b7b41cd-75b5-4594-8407-25cd11944374",{"pageContent":"process by working with other stakeholders of the project. \n Reviews testing results and ensures quality and adherence to SDLC processes. Experience of working in high \npressure environments with strong time management and prioritization skills Proficient in establishing testing \nenvironment, preparation of test scenarios test cases & reviewing the test 10 of 2055 words Accessibility. \n Responsible for the evaluation of new automation tools and methods to increase testing efficiency and coverage of \nhighly configurable systems. Responsible for working with other departments to define new strategies for testing. \n Involved in Requirements review and participated in JAD sessions, involved in architecture/design reviews to \nemphasize the test strategy and to ensure best practices. \n Experienced in Functional Testing, System Integration Testing, Back End Testing, GUI Testing, Configuration \nTesting & User Acceptance Testing.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":17,"to":26}}}}],["f3b4d0cc-a72c-418b-a3a6-9c4e6aec0b4c",{"pageContent":" Experienced in Functional Testing, System Integration Testing, Back End Testing, GUI Testing, Configuration \nTesting & User Acceptance Testing. \n status reports to highlight the state of releases, testing projects, impacts/concerns. \n Capture quality assurance data and metrics to the Managers providing multiple perspectives for analyzing the \ndata. Prepare, Track and Report KPIs, Metrics, Status Reports Etc. \n Conducted knowledge sharing sessions with respect to competency enhancements on Banking Domain, Load \nRunner, Enhanced static testing and Business process testing. \n Having basic knowledge on designing Automation Architecture (Framework) by using Data Driven and Keyword \ndriven techniques for the Automation. Expertise in Defect Tracking, Report generation and requirement tracking \nthroughout the test life cycle using QC. Expertise in Descriptive Programming for developing QTP Scripts. \n Expertise in defect tracking Maintain system and bug life cycle using Test Director.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":25,"to":35}}}}],["002eb356-4ebf-4bec-bdfe-87ce04659ed5",{"pageContent":"throughout the test life cycle using QC. Expertise in Descriptive Programming for developing QTP Scripts. \n Expertise in defect tracking Maintain system and bug life cycle using Test Director. \n Expertise in writing and testing Queries, Views, Triggers, and Stored Procedures in Oracle and SQL Server. \nI have knowledge on testing of application in JAVA and JEE architectures. \n Excellent understanding of documentation in testing environment. \n Organized weekly Project Status and Task Review meetings. Created PowerPoint presentations and project \nupdates using MS Project for management review. Good Communication, Interpersonal skills, and strong Team \nplayer with proficiency at time management, multitasking, able to meet deadlines and handle changing priorities. \nSKILL SET","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":2,"lines":{"from":34,"to":42}}}}],["cfbcd50b-3d90-4688-8218-dbb665ae2969",{"pageContent":"SKILL SET \n \n \n \nTesting Tools \nSOAP UI, Load Runner, Win Runner, Selenium, RPT, \nUFT, Test Director, Quality Center, Microsoft Test \nManager, Load Runner \nDatabase Oracle 8.0, SQL Server 2003, DB2 \nDefect tracking tools \nTest Director/Quality Center, ALM, Rational Clear \nQuest, Jira \nConfiguration Mgmt. tools VSS, SVN, and RMS \nOperating System Linux, Windows \nLanguages C, C++, ASP, Java HTML, VB, SQL \n \n \n \nPROFESSIONAL EXPERIENCE \n \nDeloitte Apr’2023 – Present \nQuality Assurance Tester \nResponsibilities: \n \n \n Created test plan and test cases for manual and automated testing from the business requirements to match the \nproject's initiatives. \n Analyzing business requirements, Product design documents, specifications and development of test scripts and \ntest cases. \n Preparing test strategy and test scenarios, conducting functional demos to business users. \n Conducting testing and defects status meetings.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":1,"to":31}}}}],["48469cec-7c89-4309-bdae-fe01ac13f76e",{"pageContent":"test cases. \n Preparing test strategy and test scenarios, conducting functional demos to business users. \n Conducting testing and defects status meetings. \n Writing simple to complex SQL queries to verify database tables for data inserted from GUI. \n Designed Functions Library, Functions, Subroutines, Common functions, Utilities functions, Regular Expressions \nand Environmental variables using UFT in VB scripts. \n Interacts with Development and Business Team to clarify the requirements and queries. \n Performed various Section 508 accessibility Compliance test with JAWS, NVDA, Voiceover, Chromevox, Tack back, \nWAT, MAGIC etc. Logged, monitored and retested defects in QC for Section \n Assisted developers with understanding and then resolving the functional, non-functional, compatibility, 508 \nCompliance defects. \n Provide Accessibility training and requirements \n Performed Accessibility testing using Accessibility platforms including Windows and MacOS","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":29,"to":41}}}}],["a1194433-a00f-4df5-b07b-5ddcb3fa1d4e",{"pageContent":"Compliance defects. \n Provide Accessibility training and requirements \n Performed Accessibility testing using Accessibility platforms including Windows and MacOS \n Performed PDF and document testing. \n Performed Accessibility testing by analyzing code for accessibility issues. \n Involved in Manual and section 508 testing JAWS Certified of Web and Client Server Application. \n Analyzed BRD, FRD, SRS, PTS, Use Case, Data Model or Data Mapping documents for writing test \n Effectively communicate with business & development teams and set goals & timelines for automation. \n Effectively communicate quality practices to both technical and leadership audiences through documentation, \npresentations and verbal communications.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":3,"lines":{"from":39,"to":48}}}}],["ae8e61b0-f21f-4cbc-90e5-ffd63cf9dcae",{"pageContent":" Conduct functional, usability, user acceptance, end-to-end testing against specified criteria and requirements. \n Analyze and recommend the extent of functional testing required based on project requirements. \n Created documenting requirements and traceability of requirements to test conditions and cases using a \nrequirement management tool. \n Responsible for mapping test cases and conditions to requirements and Responsible for writing test cases and \nconditions. \n Contribute to various streams of implementation projects and collaborate with team members, develop, and \nimplement project activities to achieve project and client goals. \n Escalate issues to TM as appropriate. \n Reviewing and elaborating stakeholder requirements such as Acceptance Criteria are precise. \n Execution of Non-Functional regression testing to ensure the resiliency and performance of the system.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":1,"to":11}}}}],["a3074046-cad3-4bdc-9ad9-7b29118be6fe",{"pageContent":" Execution of Non-Functional regression testing to ensure the resiliency and performance of the system. \n Proven experience of working in an Agile development environment, ideally with experience of working within a \ndistributed team. \n Developed vast number of test cases based on the risk level criteria. \n Involved in developing the report on the product. \n Participated in reviews for the functional and business updates to the product. \n Participated in gathering all business and functional requirements to develop test plan and test cases for manual, \nstrategies, and scenarios for automation testing. \n Tested the functionality of Java application. \n Responsible for designing, writing, and reviewing of Functional Test Cases for the application. Performed GAP \nanalysis of Use Cases/Requirements. \n Developed Test Plan and scenarios for the testing from the business and functional requirements. Preparing and","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":11,"to":22}}}}],["a102dc5b-4d3c-4022-9dd6-78e88a5c80e9",{"pageContent":"analysis of Use Cases/Requirements. \n Developed Test Plan and scenarios for the testing from the business and functional requirements. Preparing and \nreviewing the Test cases for all functional Requirements in QC. Uploading the Test cases which already exist in \nExcel to QC. \n Design and Developing the Test scenarios for Web services testing. \n Execution of all the web service test scenarios by using SOAPUI. \n Preparing the work allocation for team and status reports to the management. \n Validating the application for the acceptance and Data validation while Batch processing. Wrote test cases and \nscripts for both manual testing. Scheduled the tests through Test Director. Involved in the development of Test \nCases, Scenarios, and steps. \n Involved in the business analysis of data for test cases and scenarios. \n Involved in creating the Excel sheets with all the data to be used in manual test cases.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":21,"to":32}}}}],["84ff3141-6ba9-4a65-acfe-fa2abb98b51a",{"pageContent":"Cases, Scenarios, and steps. \n Involved in the business analysis of data for test cases and scenarios. \n Involved in creating the Excel sheets with all the data to be used in manual test cases. \n Developed User defined function for custom results and framework set-up for test batch execution. Developed the \nscripts using Descriptive programming for some scripts. Developed a lot of user defined functions using VB Script \nfor reusability and easy maintenance. \n Fully integrated with Test Director for Test Management activities, creates separate test sets for each release \nbased on the severity. \n Participated in Defect Review Board meetings to verify and review various defects logged against the application. \n Participated in daily and weekly meetings to discuss the various development levels of the project. \n Performed Smoke, functional and system testing. \n Submitted weekly Status reports to the Manager and made timely escalations to the management.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":4,"lines":{"from":30,"to":41}}}}],["245bd2d8-eaa4-4bfd-b007-0c43b750cebf",{"pageContent":"Environment: Windows, UNIX, Quick Test Pro, Quality Center, SQL, PL/SQL, SOAP-UI, XML, JAVA, Oracle, MS- \nProject, MS-Office Suite, MS Visio. \n \nFidelity Investments                                                                                                                        Sep’2020 -March 2023 \nQuality Assurance Tester \nResponsibilities: \n Created test plan and test cases for manual and automated testing from the business requirements to match the \nproject's initiatives. \n Analyzing business requirements, Product design documents, specifications and development of test scripts and  \ntest cases. \n Preparing test strategy and test scenarios, conducting functional demos to business users. \n Conducting testing and defects status meetings. \n Writing simple to complex SQL queries to verify database tables for data inserted from GUI. \n Interacts with the Development and Business Team to clarify the requirements and queries.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":1,"to":14}}}}],["a00d7d1b-e5a4-46ea-a55c-97ed9900f7b7",{"pageContent":" Writing simple to complex SQL queries to verify database tables for data inserted from GUI. \n Interacts with the Development and Business Team to clarify the requirements and queries. \n Effectively communicate with business & development teams and set goals & timelines for automation. \n Effectively communicate quality practices to both technical and leadership audiences through documentation, \npresentations, and verbal communications. \n Conduct functional, usability, user acceptance, end-to-end testing against specified criteria and requirements. \n Analyze and recommend the extent of functional testing required based on project requirements. \n Created documenting requirements and traceability of requirements to test conditions and cases using a  \nrequirement management tool (e.g., DOORS, Rational Rose). \n Responsible for mapping test cases and conditions to requirements and Responsible for writing test cases and \nconditions.","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":13,"to":23}}}}],["18fb4f07-ae75-49cf-89f0-4d0011d4e7ec",{"pageContent":"requirement management tool (e.g., DOORS, Rational Rose). \n Responsible for mapping test cases and conditions to requirements and Responsible for writing test cases and \nconditions. \n Contribute to various streams of implementation projects and collaborate with team members, develop, and \nimplement project activities to achieve project and client goals. \n Escalate issues to TM as appropriate. \n Execution of all the web service test scenarios by using SOAPUI \n Reviewing and elaborating stakeholder requirements such as Acceptance Criteria are precise. \n Execution of repeatable QA / Acceptance Test using HP ALM. \n Execution of Non-Functional regression testing to ensure the resiliency and performance of the system. \n Proven experience of working in an Agile development environment, ideally with experience of working within a \ndistributed team. \n Involved in developing the report on the product","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":21,"to":33}}}}],["84997fe0-dfb9-421f-8e01-c21aa2d1c678",{"pageContent":" Proven experience of working in an Agile development environment, ideally with experience of working within a \ndistributed team. \n Involved in developing the report on the product \n Responsible for designing, writing, and reviewing of Functional Test Cases for the application. Performed GAP \nanalysis of Use Cases/Requirements \n Developed Test Plan and scenarios for the testing from the business and functional requirements. Preparing and \nreviewing the Test cases for all functional Requirements in QC. Uploading the Test cases which already exist in \nExcel to QC. \n Participated in reviews for the functional and business updates to the product. \n Participated in gathering all business and functional requirements to develop test plan and test cases for manual, \nstrategies, and scenarios for automation testing. \n","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":5,"lines":{"from":31,"to":42}}}}],["67c190e4-61b9-4e0e-85ec-93a5427eddec",{"pageContent":" Developed Test Plan and scenarios for the testing from the business and functional requirements. Preparing and \nreviewing the Test cases for all functional Requirements in QC. Uploading the Test cases which already exist in Excel \nto QC. \n Design and Developing the Test scenarios for Web services testing. \n         Environment: Windows, UNIX, Perl, Quick Test Pro, Quality Center, TOAD, SQL, PL/SQL, SOAP-UI, XML, \n        JAVA, Oracle, MS- Project, MS-Office Suite, MS Visio. \n \n       ACADEMIC QUALIFICATION: \n \n Master of Science in Computer & Information Systems – Trine University, Detroit, Graduated. \n Bachelor of Engineering in Computer Science and Engineering (B. Tech).","metadata":{"source":"/tmp/resume-processor-rlnexr/ADA_Tester_Deloitte_Bindu.pdf","pdf":{"version":"1.10.100","info":{"PDFFormatVersion":"1.5","IsAcroFormPresent":false,"IsXFAPresent":false,"Producer":"iLovePDF","ModDate":"D:20250203200353Z"},"metadata":null,"totalPages":6},"loc":{"pageNumber":6,"lines":{"from":2,"to":12}}}}]],{"0":"6ebbc524-d174-4e6a-ab51-175539285e43","1":"867c11a4-9809-4ea9-a415-17c2854382a4","2":"b4a43e6e-53cd-495d-ab31-a4a06c000903","3":"239fea55-5eca-487f-8ccf-92eb34f06bec","4":"734d86a6-68df-42d4-8592-f13a2fe6332e","5":"48422256-f6b2-4652-add0-698a14daf45f","6":"3b7b41cd-75b5-4594-8407-25cd11944374","7":"f3b4d0cc-a72c-418b-a3a6-9c4e6aec0b4c","8":"002eb356-4ebf-4bec-bdfe-87ce04659ed5","9":"cfbcd50b-3d90-4688-8218-dbb665ae2969","10":"48469cec-7c89-4309-bdae-fe01ac13f76e","11":"a1194433-a00f-4df5-b07b-5ddcb3fa1d4e","12":"ae8e61b0-f21f-4cbc-90e5-ffd63cf9dcae","13":"a3074046-cad3-4bdc-9ad9-7b29118be6fe","14":"a102dc5b-4d3c-4022-9dd6-78e88a5c80e9","15":"84ff3141-6ba9-4a65-acfe-fa2abb98b51a","16":"245bd2d8-eaa4-4bfd-b007-0c43b750cebf","17":"a00d7d1b-e5a4-46ea-a55c-97ed9900f7b7","18":"18fb4f07-ae75-49cf-89f0-4d0011d4e7ec","19":"84997fe0-dfb9-421f-8e01-c21aa2d1c678","20":"67c190e4-61b9-4e0e-85ec-93a5427eddec"}]